app/controllers/halls_controller.rb

INSERT INTO "halls" ("name", "seat", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bongo bundhu"], ["seat", "1000"], ["created_at", "2017-07-23 17:13:40.880338"], ["updated_at", "2017-07-23 17:13:40.880338"]]
---
  def create
    @hall = Hall.new(hall_params)

    if @hall.save