app/controllers/halls_controller.rb

SELECT "halls".* FROM "halls"
---
  def index
    @halls = Hall.all